### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.storage_itn.azurerm_storage_queue.access_itn has changed
  ~ resource "azurerm_storage_queue" "access_itn" {
        id                   = "https://iopitnfimsst01.queue.core.windows.net/access-queue"
      + metadata             = {}
        name                 = "access-queue"
        # (2 unchanged attributes hidden)
    }

  # module.storage_itn.azurerm_storage_queue.audit_events_itn has changed
  ~ resource "azurerm_storage_queue" "audit_events_itn" {
        id                   = "https://iopitnfimsst01.queue.core.windows.net/audit-events"
      + metadata             = {}
        name                 = "audit-events"
        # (2 unchanged attributes hidden)
    }

  # module.storage_itn.azurerm_storage_queue.config_itn has changed
  ~ resource "azurerm_storage_queue" "config_itn" {
        id                   = "https://iopitnfimsst01.queue.core.windows.net/config-queue"
      + metadata             = {}
        name                 = "config-queue"
        # (2 unchanged attributes hidden)
    }

  # module.storage_itn.azurerm_storage_queue.export_itn has changed
  ~ resource "azurerm_storage_queue" "export_itn" {
        id                   = "https://iopitnfimsst01.queue.core.windows.net/export-queue"
      + metadata             = {}
        name                 = "export-queue"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.itn_resource_group.azurerm_resource_group.this will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01"
        name       = "io-p-itn-fims-rg-01"
      ~ tags       = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
          - "ModuleName"     = "azure_github_environment_bootstrap" -> null
          - "ModuleSource"   = "DX" -> null
          - "ModuleVersion"  = "2.4.4" -> null
          ~ "Source"         = "https://github.com/pagopa/io-fims/tree/main/infra/repository" -> "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (2 unchanged attributes hidden)
    }

  # module.key_vaults.azurerm_role_assignment.identity_fims_cd_certificates must be replaced
-/+ resource "azurerm_role_assignment" "identity_fims_cd_certificates" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/providers/Microsoft.Authorization/roleAssignments/59b82d5a-24f7-04ff-c54f-7ebcdc597dee" -> (known after apply)
      ~ name                                   = "59b82d5a-24f7-04ff-c54f-7ebcdc597dee" -> (known after apply)
      ~ principal_id                           = "ea69d874-1695-46aa-8737-85fa67dc882d" -> "1def1c67-aed2-449c-96d5-0aeae24a1597" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/a4417e6f-fecd-4de8-b567-7b0420556985" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.key_vaults.azurerm_role_assignment.identity_fims_cd_secrets must be replaced
-/+ resource "azurerm_role_assignment" "identity_fims_cd_secrets" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/providers/Microsoft.Authorization/roleAssignments/d01f0c62-bb22-af45-afbc-ca5ee7ecf43f" -> (known after apply)
      ~ name                                   = "d01f0c62-bb22-af45-afbc-ca5ee7ecf43f" -> (known after apply)
      ~ principal_id                           = "ea69d874-1695-46aa-8737-85fa67dc882d" -> "1def1c67-aed2-449c-96d5-0aeae24a1597" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.key_vaults.azurerm_role_assignment.identity_fims_ci_certificates must be replaced
-/+ resource "azurerm_role_assignment" "identity_fims_ci_certificates" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/providers/Microsoft.Authorization/roleAssignments/a196ccc5-70fe-e411-00dc-2a9dd344c87e" -> (known after apply)
      ~ name                                   = "a196ccc5-70fe-e411-00dc-2a9dd344c87e" -> (known after apply)
      ~ principal_id                           = "452b7c46-b8f1-481e-a22d-8f2249ebe63a" -> "555f08ad-5660-45ce-a7fb-df0e43b66f23" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/a4417e6f-fecd-4de8-b567-7b0420556985" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.key_vaults.azurerm_role_assignment.identity_fims_ci_secrets must be replaced
-/+ resource "azurerm_role_assignment" "identity_fims_ci_secrets" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/providers/Microsoft.Authorization/roleAssignments/954c9243-6f51-dc67-dbd4-dc5795cc851f" -> (known after apply)
      ~ name                                   = "954c9243-6f51-dc67-dbd4-dc5795cc851f" -> (known after apply)
      ~ principal_id                           = "452b7c46-b8f1-481e-a22d-8f2249ebe63a" -> "555f08ad-5660-45ce-a7fb-df0e43b66f23" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.key_vaults_itn.azurerm_key_vault.fims_itn_key_vault will be created
  + resource "azurerm_key_vault" "fims_itn_key_vault" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-fims-kv-01"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "io-p-itn-fims-rg-01"
      + sku_name                      = "premium"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + tenant_id                     = "7788edaf-0346-4068-9d79-c868aed15b3d"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.key_vaults_itn.azurerm_key_vault_key.op_app will be created
  + resource "azurerm_key_vault_key" "op_app" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "sign",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = (known after apply)
      + n                       = (known after apply)
      + name                    = "op-app-key"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_admin_certificates will be created
  + resource "azurerm_role_assignment" "adgroup_admin_certificates" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_admin_keys will be created
  + resource "azurerm_role_assignment" "adgroup_admin_keys" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_admin_secrets will be created
  + resource "azurerm_role_assignment" "adgroup_admin_secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_developers_certificates will be created
  + resource "azurerm_role_assignment" "adgroup_developers_certificates" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_developers_keys will be created
  + resource "azurerm_role_assignment" "adgroup_developers_keys" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_developers_secrets will be created
  + resource "azurerm_role_assignment" "adgroup_developers_secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_externals_certificates will be created
  + resource "azurerm_role_assignment" "adgroup_externals_certificates" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "40bbc0a5-547d-40f8-83df-81409a871b02"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_externals_keys will be created
  + resource "azurerm_role_assignment" "adgroup_externals_keys" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "40bbc0a5-547d-40f8-83df-81409a871b02"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.adgroup_externals_secrets will be created
  + resource "azurerm_role_assignment" "adgroup_externals_secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "40bbc0a5-547d-40f8-83df-81409a871b02"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.identity_fims_cd_certificates will be created
  + resource "azurerm_role_assignment" "identity_fims_cd_certificates" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1def1c67-aed2-449c-96d5-0aeae24a1597"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.identity_fims_cd_secrets will be created
  + resource "azurerm_role_assignment" "identity_fims_cd_secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1def1c67-aed2-449c-96d5-0aeae24a1597"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.identity_fims_ci_certificates will be created
  + resource "azurerm_role_assignment" "identity_fims_ci_certificates" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "555f08ad-5660-45ce-a7fb-df0e43b66f23"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificates Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vaults_itn.azurerm_role_assignment.identity_fims_ci_secrets will be created
  + resource "azurerm_role_assignment" "identity_fims_ci_secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "555f08ad-5660-45ce-a7fb-df0e43b66f23"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 19 to add, 1 to change, 4 to destroy.
```

</details>
